Tekla Open API Reference for Tekla Structures 2025
Matrix Class
 The Matrix class represents a 4x3 matrix.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Geometry3d.Matrix
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class Matrix
<SerializableAttribute>
Public Class Matrix
The Matrix type exposes the following members.
Constructors
Name | Description
Matrix()
 Creates a new indentity matrix.
Matrix(Matrix)
 Creates a new matrix which is a copy of the given matrix.
Top
Properties
Name | Description
Item
 Sets or gets the matrix element values.
Top
Methods
Name | Description
GetTranspose
 Returns a new matrix which is a transpose of the current matrix. The transposed matrix is an inversion of the current matrix, if the current matrix was a valid rotation matrix.
ToString
 Returns a string that represents the current matrix.
 (Overrides Object.ToString().)
Transform(IEnumerable<Point>)
 Transforms the given points using the current matrix.
Transform(Point)
 Transforms the given point using the current matrix.
Transpose
 Transposes a matrix. The resulting matrix is an inversion of the current matrix, if the current matrix was a valid rotation matrix.
Top
Operators
Name | Description
Multiply(Matrix, IEnumerable<Point>)
 Transforms the given points using the given matrix.
Multiply(Matrix, Matrix)
 Multiplies (combines) two transformation matrices.
Multiply(Matrix, Point)
 Transforms the given point using the given matrix.
Top
See Also
Reference
Tekla.Structures.Geometry3d Namespace